Catalogs/СобеседникиЧатботов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СобеседникиЧатботов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СобеседникиЧатботов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеСобеседника() Экспорт
	
	Описание = Новый Структура(
		"Код, 
		|Имя,
		|Фамилия,
		|КраткоеИмя");
	
	Описание.Код = 0;
	Описание.Имя = "";
	Описание.Фамилия = "";
	Описание.КраткоеИмя = "";
	
	Возврат Описание;
	
КонецФункции

Функция СоздатьСобеседника(Код, Описание = Неопределено) Экспорт
	
	СобеседникСсылка = Справочники.СобеседникиЧатботов.НайтиПоКоду(Код);
	Если Не СобеседникСсылка.Пустая() Тогда
		Возврат СобеседникСсылка;
	КонецЕсли;
	
	Если Описание = Неопределено Тогда
		Описание = ОписаниеСобеседника();
	КонецЕсли;
	
	СобеседникОбъект = Справочники.СобеседникиЧатботов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СобеседникОбъект, Описание);
	СобеседникОбъект.Код = Код;
	СобеседникОбъект.Наименование = Описание.Имя;
	СобеседникОбъект.Записать();
	
	Возврат СобеседникСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
